<a href="https://colab.research.google.com/github/RishavYaduvanshi/DMDW_LAB/blob/main/Lab3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1)
A) Create a Dataframe (size= 3x4) with random integers with
explicit indexing.
B) Perform sin(df * pi / 4) operation over the dataframe
C) Subtract first value of the dataframe from each elements of
the dataframe.
D) Subtract first row of the dataframe from each rows of the
dataframe.

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(0, 100, size=(3, 4)), columns=list('ABCD'))
print(df)

    A   B   C   D
0  38  29  57  91
1  49  76  57  66
2  75  95  24  63

In [ ]:
np.sin(df * np.pi / 4)
first_value = df.iloc[0][1]
print(df.subtract(first_value, axis=1))

    A   B   C   D
0   9   0  28  62
1  20  47  28  37
2  46  66  -5  34

In [ ]:
first_row = df.iloc[0]
print(df.subtract(first_row, axis=1))

    A   B   C   D
0   0   0   0   0
1  11  47   0 -25
2  37  66 -33 -28

2) Write python program: A) Read a CSV file using pandas
data frame. B) Display the first 8 rows of the data. C) Display
the last 7 rows of the data. D) Get and display the data types
used in this data. Get and display the unique values available
under a particular attribute.

In [ ]:
x = 'https://bit.ly/31LpcE3'
df1 = pd.read_csv(x)
df1.head(8)

          Unnamed: 0   mpg  cyl   disp   hp  ...   qsec  vs  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  ...  16.46   0   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  ...  17.02   0   1     4     4
2         Datsun 710  22.8    4  108.0   93  ...  18.61   1   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  ...  19.44   1   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  ...  17.02   0   0     3     2
5            Valiant  18.1    6  225.0  105  ...  20.22   1   0     3     1
6         Duster 360  14.3    8  360.0  245  ...  15.84   0   0     3     4
7          Merc 240D  24.4    4  146.7   62  ...  20.00   1   0     4     2

[8 rows x 12 columns]

In [ ]:
df1.tail(7)

        Unnamed: 0   mpg  cyl   disp   hp  ...  qsec  vs  am  gear  carb
25       Fiat X1-9  27.3    4   79.0   66  ...  18.9   1   1     4     1
26   Porsche 914-2  26.0    4  120.3   91  ...  16.7   0   1     5     2
27    Lotus Europa  30.4    4   95.1  113  ...  16.9   1   1     5     2
28  Ford Pantera L  15.8    8  351.0  264  ...  14.5   0   1     5     4
29    Ferrari Dino  19.7    6  145.0  175  ...  15.5   0   1     5     6
30   Maserati Bora  15.0    8  301.0  335  ...  14.6   0   1     5     8
31      Volvo 142E  21.4    4  121.0  109  ...  18.6   1   1     4     2

[7 rows x 12 columns]

In [ ]:
df.dtypes

A    int64
B    int64
C    int64
D    int64
dtype: object

3) Write a python program: A) Read a dataset (Ex, iris.csv)
using pandas data frame. B) Rename a column. C) Filter the
data using some condition (Ex. sepal length >7.2). D) Find
the mean and standard deviation value for each attribute.

In [ ]:
iris_url = 'https://bit.ly/3mUbLK6'
df3 = pd.read_csv(iris_url)
df3

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [ ]:
df3.rename (columns={'sepal_width':'SEPAL_WIDTH'})
df3[df3['petal.length']>7.2]
df3.std(axis=1,skipna=True)
df3.mean(axis=0)

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

4) Write a python program: A) Read a dataset (Ex, iris.csv)
data using pandas data frame. B) Next, check if there exist
any duplicate values. C) If exist any duplicate values then
remove the duplicate values.

In [ ]:
duplicate = df3[df3.duplicated()]
duplicate

     sepal.length  sepal.width  petal.length  petal.width    variety
142           5.8          2.7           5.1          1.9  Virginica

In [ ]:
df3.drop_duplicates(keep=False,inplace=True)
df3

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[148 rows x 5 columns]

5) Show using a program how to group data in python using
pandas.

In [ ]:
nba_link = 'https://bit.ly/3wshrxY'
df4 = pd.read_csv(nba_link)
df4

              Name            Team  ...            College     Salary
0    Avery Bradley  Boston Celtics  ...              Texas  7730337.0
1      Jae Crowder  Boston Celtics  ...          Marquette  6796117.0
2     John Holland  Boston Celtics  ...  Boston University        NaN
3      R.J. Hunter  Boston Celtics  ...      Georgia State  1148640.0
4    Jonas Jerebko  Boston Celtics  ...                NaN  5000000.0
..             ...             ...  ...                ...        ...
453   Shelvin Mack       Utah Jazz  ...             Butler  2433333.0
454      Raul Neto       Utah Jazz  ...                NaN   900000.0
455   Tibor Pleiss       Utah Jazz  ...                NaN  2900000.0
456    Jeff Withey       Utah Jazz  ...             Kansas   947276.0
457            NaN             NaN  ...                NaN        NaN

[458 rows x 9 columns]

In [ ]:
print(df4.groupby('Team').first())

                                         Name  ...      Salary
Team                                           ...
Atlanta Hawks                   Kent Bazemore  ...   2000000.0
Boston Celtics                  Avery Bradley  ...   7730337.0
Brooklyn Nets                Bojan Bogdanovic  ...   3425510.0
Charlotte Hornets               Nicolas Batum  ...  13125306.0
Chicago Bulls                Cameron Bairstow  ...    845059.0
Cleveland Cavaliers       Matthew Dellavedova  ...   1147276.0
Dallas Mavericks              Justin Anderson  ...   1449000.0
Denver Nuggets                 Darrell Arthur  ...   2814000.0
Detroit Pistons                  Joel Anthony  ...   2500000.0
Golden State Warriors         Leandro Barbosa  ...   2500000.0
Houston Rockets                  Trevor Ariza  ...   8193030.0
Indiana Pacers                    Lavoy Allen  ...   4050000.0
Los Angeles Clippers             Cole Aldrich  ...   1100602.0
Los Angeles Lakers               Brandon Bass  ...   3000000.0
Memphis Grizzlies                Jordan Adams  ...   1404600.0
Miami Heat                         Chris Bosh  ...  22192730.0
Milwaukee Bucks         Giannis Antetokounmpo  ...   1953960.0
Minnesota Timberwolves        Nemanja Bjelica  ...   3950001.0
New Orleans Pelicans            Alexis Ajinca  ...   4389607.0
New York Knicks                 Arron Afflalo  ...   8000000.0
Oklahoma City Thunder            Steven Adams  ...   2279040.0
Orlando Magic                  Dewayne Dedmon  ...    947276.0
Philadelphia 76ers                Elton Brand  ...    947276.0
Phoenix Suns                     Eric Bledsoe  ...  13500000.0
Portland Trail Blazers        Cliff Alexander  ...    525093.0
Sacramento Kings                   Quincy Acy  ...    981348.0
San Antonio Spurs           LaMarcus Aldridge  ...  19689000.0
Toronto Raptors               Bismack Biyombo  ...   2814000.0
Utah Jazz                       Trevor Booker  ...   4775000.0
Washington Wizards              Alan Anderson  ...   4000000.0

[30 rows x 8 columns]